backend/views/shelf/_formFile.php

SELECT `name`, `shelf`.`id_shelf` FROM `shelf`
SELECT `name`, `cupboards`.`id_cupboards` FROM `cupboards` WHERE `id_shelf`='68'
---
// *  @var $cupboards
 */

$shelfs = \common\models\Shelf::find()
    ->select('name')
    ->indexBy('id_shelf')
    ->column();

$cupboards = \common\models\Cupboards::find()
    ->select('name')
    ->where(['id_shelf' => $selectedShelf])
    ->indexBy('id_cupboards')
    ->column();